package com.github.weichun97.common.api;

import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.NoArgsConstructor;

/**
 * @author:
 * @create: 2020-08-03 14:53
 * @description: 通用返回信息
 */
@Getter
@NoArgsConstructor
@AllArgsConstructor
public enum ResultCode implements IErrorCode {

    /**
     * 操作成功
     */
    SUCCESS(200, "操作成功"),
    /**
     * 操作失败
     */
    FAILED(500, "操作失败"),
    /**
     * 暂未登录或token已经过期
     */
    UNAUTHORIZED(401, "暂未登录或token已经过期"),
    /**
     * 参数检验失败
     */
    VALIDATE_FAILED(402, "参数检验失败"),
    /**
     * 没有相关权限
     */
    FORBIDDEN(403, "没有相关权限"),

    /**
     * 登录失败,帐号或密码错误
     */
    LOGIN_FAILED(405, "登录失败,帐号或密码错误"),

    LOGIN_CODE_TIMEOUT(405, "登录失败,验证码已过期"),

    LOGIN_CODE_FAILED(405, "登录失败,验证码输入错误"),

    DATA_IS_NULL(501, "操作的数据异常"),
    REMOTE_CALL_FAILED(502, "远程调用失败"),

    /**
     * 01 航班模块
     */
    // 航班计划 0101
    CODE_20101001(20101001, "航班计划详情获取失败"),
    CODE_10101002(10101002, "请不要重复审核"),
    CODE_10101003(10101003, "航班计划不存在"),
    CODE_10101004(10101004, "航线不存在"),
    CODE_10101005(10101005, "船名不存在"),
    CODE_10101006(10101006, "禁止删除已审核的航班计划申请记录"),
    CODE_10101007(10101007, "航线与船名重复"),
    CODE_10101008(10101008, "禁止删除已审核的航班计划"),
    CODE_10101009(10101009, "航班计划已存在"),
    CODE_10101010(10101010, "航班计划的开始日期不能小于等于当前日期"),
    // 航班变更 0102
    CODE_10102001(10102001, "航班不存在"),
    CODE_10102002(10102002, "无新的航班变更"),
    CODE_10102003(10102003, "航班变更申请不存在"),
    CODE_10102004(10102004, "请不要重复审核"),
    CODE_10102005(10102005, "航班未变更"),
    CODE_10102006(10102006, "禁止删除已审核的航班变更申请记录"),
    CODE_10102007(10102007, "审核中禁止修改"),
    CODE_10102008(10102008, "审核中禁止重置航班"),
    CODE_10102009(10102009, "抵港时间必须大于开航时间"),
    CODE_10102010(10102010, "禁止审核通过当前日志之前的航班变更计划"),
    // 航班基础数据 0103
    CODE_10103001(10103001, "航班状态不存在"),
    CODE_10103002(10103002, "航班异常原因不存在"),
    CODE_10103003(10103003, "禁止存在重复的航站"),
    CODE_10103004(10103004, "始发站不存在"),
    CODE_10103005(10103005, "目的站不存在"),
    CODE_10103006(10103006, "始发或目的必须为蛇口港"),
    // 港口管理 0104
    CODE_10104001(10104001, "港口编码已存在"),
    CODE_10104002(10104002, "港口名称已存在"),
    CODE_10104003(10104003, "港口数据已被使用，请勿删除"),
    // 航线管理 0105
    CODE_10105001(10105001, "航线已存在"),
    CODE_10105002(10105002, "航线类型不存在"),
    CODE_10105003(10105003, "停靠站中不能有始发站和目的站"),
    CODE_10105004(10105004, "始发站和目的站不能相同"),
    CODE_10105005(10105005, "航线不存在"),
    CODE_10104006(10104006, "航线数据已被使用，请勿删除"),
    CODE_10104007(10104007, "无关联航线"),
    // 船公司管理 0106
    CODE_10106001(10106001, "船公司已存在"),
    // 船舶管理 0107
    CODE_10107001(10107001, "船舶代码已存在"),
    CODE_10107002(10107002, "船舶名称已存在"),
    // 泊位管理 0108
    CODE_10108001(10108001, "请选择航班"),
    CODE_10108002(10108002, "泊位不存在"),
    CODE_10108003(10108003, "泊位已被占用"),
    CODE_10108004(10108004, "泊位时刻不存在"),
    CODE_10108005(10108005, "泊位未分配"),
    CODE_10108006(10108006, "船舶未出港"),
    CODE_10108007(10108007, "泊位已禁用"),
    CODE_10108008(10108008, "泊位不可使用"),
    CODE_10108009(10108009, "港池有船正在移动"),
    CODE_10108010(10108010, "无法出港"),
    CODE_10108011(10108011, "请不要重复分配"),

    // 作业申请管理 0109
    CODE_10109001(10109001, "不正确的作业申请时间"),
    CODE_10109002(10109002, "审核错误!申请已审核"),
    CODE_10109003(10109003, "审核错误!请输入不通过原因"),
    CODE_10109004(10109004, "申请已作业完毕,不可重复操作"),
    CODE_10109005(10109005, "申请审核未通过,不可操作"),
    CODE_10109006(10109006, "申请未完成,无需撤销"),
    CODE_10109007(10109007, "申请状态已更改,无法进行撤销操作"),
    CODE_10109008(10109008, "当前状态不能删除申请"),
    CODE_10109009(10109009, "当前状态不能重新提交申请"),
    CODE_10109010(10109010, "申请状态有变,无法对其进行审核"),
    CODE_10109011(10109011, "获取定时任务获取授权失败"),

    // 调度管理 0110
    CODE_10110001(10110001, "非进港航班"),
    CODE_10110002(10110002, "非将进港航班无法报港"),
    CODE_10110003(10110003, "请先报港"),
    CODE_10110004(10110004, "不处于靠泊中"),
    CODE_10110005(10110005, "非出港航班"),
    CODE_10110006(10110006, "当前未靠泊"),
    CODE_10110007(10110007, "当前船舶未进行离港"),
    CODE_10110008(10110008, "当前船舶无法移泊"),
    CODE_10110009(10110009, "当前泊位无法使用"),
    CODE_10110010(10110010, "非正在进港船"),
    CODE_10110011(10110011, "无出港航班"),
    CODE_10110012(10110012, "非将出船舶"),
    CODE_10110013(10110013, "船不在等候区"),
    CODE_10110014(10110014, "船不在泊位"),

    // 调度列表 0111
    CODE_10111001(10111001, "时间查询范围不能超过7天"),
    CODE_10111002(10111002, "无法修改未靠泊航班的靠泊时间"),
    CODE_10111003(10111003, "无法修改未离港航班的离港时间"),

    // 值班经理排班管理 0112
    CODE_10112001(10112001, "所选月份已经设置过了排班,请勿重复操作"),

    /**
     * 02 设备模块
     */
    CODE_10201001(10201001, "设备编码已存在"),
    CODE_10201002(10201002, "此分类不存在"),
    CODE_10201004(10201004, "分类名已存在"),
    CODE_10201005(10201005, "设备档案已存在"),
    CODE_10201006(10201006, "分类名称不能为空"),
    CODE_10201007(10201007, "设备不存在"),
    CODE_10201008(10201008, "缺少设备分类"),
    //设备检查记录 0202
    CODE_10202001(10202001, "无可提交的检查表单"),
    CODE_10202002(10202002, "检查项未规范检查"),
    CODE_10202003(10202003, "请先维护设备检查项"),
    CODE_10202004(10202004, "存在未操作检查项"),
    CODE_10202005(10202005, "缺少检查图片"),
    CODE_10202006(10202006, "设备未检查"),
    CODE_10202007(10202007, "该设备没有相关的检查记录"),
    //设备维修单0203
    CODE_10203001(10203001, "分配失败,维修单已分配"),
    CODE_10203002(10203002, "没有可操作的维修单"),
    CODE_10203003(10203003, "维修单已开始"),
    CODE_10203004(10203004, "请先记录维修开始时间"),
    CODE_10203005(10203005, "请输入图片或者文字"),
    CODE_10203006(10203006, "有未验收的维修记录,请先验收"),
    CODE_10203007(10203007, "维修记录已验收"),
    CODE_10203008(10203008, "请检查后再提交"),
    CODE_10203009(10203009, "当前位置不在检查范围内"),
    CODE_10203010(10203010, "请维护当前设备的坐标"),
    CODE_10203013(10203013, "获取位置信息失败"),
    CODE_10203011(10203011, "维修单以开始,不可变更维修人"),
    //设备检查标准0204
    CODE_10204001(10204001, "标准已存在"),
    CODE_10204002(10204002, "请填写检查项"),
    CODE_10204003(10204003, "申请日期过长"),
    CODE_10204004(10204004, "设备检查资料已存在"),
    //设备保养标准0205
    CODE_10205001(10205001, "该部位保养标准已存在"),
    CODE_10205002(10205002, "请填写检查项"),
    CODE_10205003(10205003, "申请日期过长"),
    CODE_10205004(10205004, "保养类型不存在"),
    CODE_10205005(10205005, "保养标准不存在"),
    CODE_10205006(10205006, "保养项不存在"),
    CODE_10205007(10205007, "请输入保养部位"),
    //设备保养记录0206
    CODE_10206001(10206001, "请选择保养日期"),
    CODE_10206002(10206002, "已保养,不允许删除"),
    CODE_10206003(10206003, "保养计划重复!"),
    CODE_10206004(10206004, "保养计划不存在!"),
    CODE_10206005(10206005, "设备未保养"),
    CODE_10206006(10206006, "禁止重复填写保养单"),
    CODE_10206007(10206007, "异常的维修单"),


    /**
     * 03 系统模块
     */
    //文件服务 01
    CODE_20301001(20301001, "服务异常,上传失败"),
    CODE_20301002(20301002, "请指定服务根目录"),
    CODE_20301003(20301003, "请选择文件"),
    CODE_20301004(20301004, "文件删除失败"),
    CODE_20301005(20301005, "上传图片大于10M,上传失败"),
    CODE_20301006(20301006, "上传文件大于50M,上传失败"),
    CODE_20301007(20301007, "无法识别文件"),
    //角色管理 02
    CODE_10302001(10302001, "当前角色名称已存在"),
    CODE_10302002(10302002, "当前角色代码已存在"),
    //用户管理 03
    CODE_10303001(10302001, "当前用户名已存在"),
    CODE_10303002(10302002, "旧密码错误!"),
    //签到签退04
    CODE_20304001(10302001, "当前用户不存在"),
    CODE_20304002(10302002, "岗位不存在"),
    CODE_20304003(10302003, "用户与岗位不符"),
    CODE_20304004(20304004, "今天已签到"),
    CODE_20304005(20304005, "今天已签退"),
    CODE_20304006(20304006, "今天未签到"),
    CODE_20304007(20304007, "无签到突堤"),
    CODE_20304008(20304008, "船不在签到的突堤"),
    // 权限管理05
    CODE_20305001(20305001, "请先删除子权限"),
    CODE_10305002(10305002, "当前菜单的子菜单不能设置为上级菜单"),
    CODE_10305003(10305003, "当前部门的子部门不能设置为上级部门"),
    // 岗位管理06
    CODE_10306001(20306001, "系统岗位禁止删除"),

    /**
     * 04 节点模块
     */
    CODE_10401001(10401001, "节点不存在"),
    CODE_10401002(10401002, "节点已完成,严禁重复提交"),

    /**
     * 05 websocket模块
     */
    CODE_10501001(10501001, "认证失败"),
    CODE_10501002(10501002, "消息类型有误"),
    // im 0502
    CODE_10502001(10502001, "不是群成员"),
    CODE_10502002(10502002, "群不存在或已被解散"),
    CODE_10502003(10502003, "不是群主"),


    /**
     * 06 结算模块
     */
    CODE_10601001(10601001, "当前费率已存在"),
    /**
     * 07 账单模块
     */
    CODE_10701001(10701001, "当前账单不能审核"),
    CODE_10701002(10701002, "当前账单不能驳回"),
    CODE_10701003(10701003, "当前费用不可修改"),

    /**
     * 09 其他
     */
    CODE_20901001(20901001, "excel导入失败"),
    CODE_10901002(10901002, "请不要上传空的excel文件"),
    CODE_20901003(20901003, "数据已存在"),
    CODE_20901004(20901004, "excel导出失败"),
    CODE_20901005(20901005, "无数据"),
    CODE_10901006(10901006, "无权操作"),
    CODE_20901007(20901007, "模板文件不存在"),
    CODE_20901008(20901008, "读取 excel 文件失败"),
    CODE_20901009(20901009, "导出失败"),
    ;
    private long code;
    private String message;

}
